site/logs/preview-html-externo.org

#+TITLE: Preview html desde otro dispositivo
#+DATE: [2021-08-05 vie]

#+INCLUDE: "../includes/settings.org" 


Obtener la dirección y generamos un qr para hacer mas 
fácil el paso de información de la computadora al teléfono

#+BEGIN_SRC
  import socket
  import pyqrcode

  port = "8080"
  s = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
  s.connect(("8.8.8.8", 80))
  a = s.getsockname()[0]
  b = "https://" + a + ":" + port

  print(pyqrcode.create(b).terminal())
  print(b)

  s.close()
#+END_SRC

y luego creamos el servidor de prueba
#+BEGIN_SRC
  python3 -m http.server 8080
#+END_SRC
