static/logs/preview-html-externo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2022-07-29 vie 14:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Preview html desde otro dispositivo</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Galindo" />
<link rel="stylesheet" type="text/css" href="../style/style.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<meta name="theme-color" content="#ffffff" />
<meta name="color-scheme" content="dark light">
<link rel="icon" type="image/x-icon" href="https://galindosoft.neocities.org/logo.png" />
</head>
<body>
<div id="content">
<h1 class="title">Preview html desde otro dispositivo</h1>
<p>
Obtener la dirección y generamos un qr para hacer mas 
fácil el paso de información de la computadora al teléfono
</p>

<pre class="example">
import socket
import pyqrcode

port = "8080"
s = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
s.connect(("8.8.8.8", 80))
a = s.getsockname()[0]
b = "https://" + a + ":" + port

print(pyqrcode.create(b).terminal())
print(b)

s.close()
</pre>

<p>
y luego creamos el servidor de prueba
</p>
<pre class="example">
python3 -m http.server 8080
</pre>
</div>
</body>
</html>
